--Проверить, что в строке есть число
SELECT 'L123JKDFJAL;SDJ;ASD' ~ '\d';

--Найти в стркое электронный адрес

SELECT regexp_match('am@intervolga.ru',  '(?:[a-z0-9!#$%&''*+/=?^_`{|}~-]+(?:\.[a-z0-9!#$%&''*+/=?^_`{|}~-]+)*|"(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21\x23-\x5b\x5d-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])*")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\[(?:(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9]))\.){3}(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9])|[a-z0-9-]*[a-z0-9]:(?:[\x01-\x08\x0b\x0c\x0e-\x1f\x21-\x5a\x53-\x7f]|\\[\x01-\x09\x0b\x0c\x0e-\x7f])+)\])');

SELECT regexp_matches('am@intervolga.ru aboba@mail.kek', '\w+@\w+\.\w+', 'gm');

--Найти файлы с расширением .txt

SELECT regexp_matches('lajsdf.txt lkasdjf;ljk.doc lsdkajf.txd aslhjk237143.txt' ,'\w+\d*\.txt', 'gm');

--Разделить поле ФИО на Имя Фамилию Имя

SELECT regexp_matches('Долбанов Идиот Ебланович', '(([А-ЯЁа-яёA-Za-z]+)( [А-ЯЁа-яёA-Za-z]{1}).+( [А-ЯЁа-яёA-Za-z]{1}).+)', 'gm');

--Преобразовать номер мобильного телефона к виду +7( код) 345-67-89 и записать обратно в таблицу

SELECT regexp_matches('+7(917) 194-57-34', '^((8|\+374|\+994|\+995|\+375|\+7|\+380|\+38|\+996|\+998|\+993)[\- ]?)?\(?\d{3,5}\)?[\- ]?\d{1}[\- ]?\d{1}[\- ]?\d{1}[\- ]?\d{1}[\- ]?\d{1}(([\- ]?\d{1})?[\- ]?\d{1})?$', 'g');

SELECT regexp_replace('+792387423423', '^((8|\+7)[\- ]?)?(\(?\d{3}\)?[\- ]?)?[\d\- ]{7,10}$', ''); --(^[\+]\d(\(\d+\)))[\s]((\d+)\-(\d+)\-(\d+))
